raibisch/ESP32_ABL/src/main.cpp
uint log_timer = 0;
unsigned long tmp_poll_time_ms  = 10000;
unsigned long ABL_PollTime_old;
unsigned long ABL_StatusSec_old;

// new: 20.4.2026 extented to 2 Wallboxes
// define variable arrays to 2 !! independend from WB_COUNT setting !!
#define WB_MAX 2
uint64_t ABL_Wh_Sum_akt[WB_MAX];             
uint64_t ABL_Wh_Sum_old[WB_MAX];
bool ABL_PauseFlag[WB_MAX] = {false, false}; //new: 9.3.2026
float     ABL_rx_Isum[WB_MAX] = {0.0,0.0};   // return value from ABL: summ of 3 phases or zero if no sensor availible
uint16_t  ABL_rx_Ipwm[WB_MAX] = {0,0};       // return value from ABL: set from ABL_tx_Icmax
float     ABL_rx_kW[WB_MAX] = {0.0, 0.0};
uint64_t  ABL_rx_Wh[WB_MAX] = {0,0}; // calculated value in Wh *NOT* kWh
String    ABL_rx_status[WB_MAX] = {ABL_STATUS_STRING[ABL_UNVALID], ABL_STATUS_STRING[ABL_UNVALID]};
String    ABL_rx_status_old[WB_MAX] = {"---", "..."};
bool      ABL_rx_aktiv[WB_MAX] = {0,0};
ABL_POLL_STATUS ABL_tx_status[WB_MAX] = {ABL_POLL_STATUS::POLL_Current, ABL_POLL_STATUS::POLL_Current};
String ABL_sChargeTime[WB_MAX] = {"00:00:00","00:00:00"};

// now wait for polling
static bool ABL_forcePollFlag[WB_MAX] = {false,false};

// Values to ABL
static uint16_t ABL_tx_Icmax[WB_MAX]   = {0,0};
static String ABL_rx_String = "";          // a String to hold incoming data
static uint16_t ABL_rx_timeoutcount[WB_MAX] = {0,0};  

static int32_t SYS_ChargeCount[WB_MAX] = {0,0};
static int32_t SYS_RestartCount = 0;
static uint16_t SYS_TimeoutCount = 0;
static String SYS_Version = "V2.1.0";
static String SYS_CompileDate =  __DATE__;
static String SYS_CompileTime = __TIME__;
static String SYS_IP = "0.0.0.0";


#ifdef MQTT_ENABLE
#define MQTT_PAYLOAD_SIZE 256      // maximum MQTT message size
#define HOSTNAME_SIZE 30      // maximum hostname size
#define STATUS_INTERVAL 10000 // MQTT status message interval [ms]
#define DATA_INTERVAL   20000 // MQTT data message interval [ms]
const char MQTT_CLIENTID[] = "ABL";
#endif
     

static long int HexString2int(String s)
{
  const String hexDigits = "0123456789ABCDEF";
  long int result = 0;
  s.toUpperCase();
  for (int i = 0; i < s.length(); i++) {
    result <<= 4;
    result |= hexDigits.indexOf(s[i]);
  }
  return result;
}


// from comment "milenko-s"
String uint64ToString(uint64_t input)
{
  String result = "";
  uint8_t base = 10;

  do
  {
    char c = input % base;
    input /= base;
    c += '0';
    result = c + result;
  } while (input);
  return result;
}

  
/* ------------------until now not used--------------------------
static String ByteToAscii(byte input) 
{
  char singleChar, out;
  char asciiString[2+1] {0,0,0}; 
  sprintf(asciiString, "%2X", input);
  return String(asciiString);
}

char ByteToAscii(const char *input) 
{
  char singleChar, out;
  memcpy(&singleChar, input, 2);
  sprintf(&out, "%c", (int)strtol(&singleChar, NULL, 16));
  return out;
}

static byte calculateLRC(String s)
{
    byte LRC = 0;
    for (int i = 0; i < s.length(); i++)
    {
        LRC ^= (byte)s[i];
    }
    return LRC;
}
---------------------------not used -------------------------*/


////////////////////////////////////////////
/// @brief init builtin LED
////////////////////////////////////////////
void initLED()
{
#ifndef WITHOUT_LED
  pinMode(LED_GPIO, OUTPUT);
  digitalWrite(LED_GPIO, HIGH);
#endif
}

/// @brief  set builtin LED
/// @param i = HIGH / LOW
void setLED(uint8_t i)
{
   //debug_printf("LED:%d\r\n", i);
#ifndef WITHOUT_LED
  digitalWrite(LED_GPIO, i);
#endif
}


//////////////////////////////////////////////////////
/// @brief  expand Class "FileVarStore" with variables
//////////////////////////////////////////////////////
class ABL_FileVarStore : public FileVarStore
{
 public:  
  // Device-Parameter
   String varDEVICE_s_Name    = "ABL-WB";
   String varDEVICE_s_Name02  = "";

   // ABL-Parameter
   uint16_t varABL_i_A_soll_high = 14;
   uint16_t varABL_i_A_soll_low  = 6;
   uint16_t varABL_i_U_netz = 230;
   uint32_t varABL_i_Scantime_ms = 30000;
   uint32_t varABL_i_logtime_ms  = 1000;

   uint16_t varABL_i_Watt_16A;
   uint16_t varABL_i_Watt_15A;
   uint16_t varABL_i_Watt_14A;
   uint16_t varABL_i_Watt_13A;
   uint16_t varABL_i_Watt_12A;
   uint16_t varABL_i_Watt_11A;
   uint16_t varABL_i_Watt_10A;
   uint16_t varABL_i_Watt_09A;
   uint16_t varABL_i_Watt_08A;
   uint16_t varABL_i_Watt_07A;
   uint16_t varABL_i_Watt_06A;

  
   uint16_t varABL2_i_Watt_16A;
   uint16_t varABL2_i_Watt_15A;
   uint16_t varABL2_i_Watt_14A;
   uint16_t varABL2_i_Watt_13A;
   uint16_t varABL2_i_Watt_12A;
   uint16_t varABL2_i_Watt_11A;
   uint16_t varABL2_i_Watt_10A;
   uint16_t varABL2_i_Watt_09A;
   uint16_t varABL2_i_Watt_08A;
   uint16_t varABL2_i_Watt_07A;
   uint16_t varABL2_i_Watt_06A;

   // 18.5.26 new in V2.0
   uint16_t varABL_i_Phase_count=3;
   uint16_t varABL2_i_Phase_count=1;

   // 13.5.26 new: in V 2.0 Load-Management for 2 Wallboxes
   uint16_t varABL_i_I_limit = 16;
#if WB_COUNT == 2
   uint16_t varABL_i_LoadBal_mode  = 0;  // 0= 50% per Box, 1=WB1 Prio 2=WB2 Prio
#else
   uint16_t varABL_i_LoadBal_mode  = 1;  // 0= 50% per Box, 1=WB1 Prio 2=WB2 Prio
#endif
  // Wifi-Parameter
   String varWIFI_s_Mode    = "STA"; // STA=client connect with Router,  AP=Access-Point-Mode (needs no router)
   String varWIFI_s_Password= "mypassword";
   String varWIFI_s_SSID    = "myssid";

#ifdef MQTT_ENABLE
  uint16_t varMQTT_i_PORT = 1883; 
  String varMQTT_s_HOST = "192.168.2.22";
  String varMQTT_s_USER = "";
  String varMQTT_s_PASS = "";
  String varMQTT_s_TOPIC_OUT   = "abl/out/";
  String varMQTT_s_PAYLOAD_OUT ="{\"status\":%s, \"ipm\":%d, \"kw\":%d, \"kwh\":%d, \"whsum\":%d}"; // change to whatever you want !
  String varMQTT_s_TOPIC_IN    ="abl/in/"; // requested payload: {"imax":<value>}  e.g. {"imax:12}
#endif
     

 protected:
   void GetVariables()
   {
     varDEVICE_s_Name     = GetVarString(GETVARNAME(varDEVICE_s_Name));
     varDEVICE_s_Name02   = GetVarString(GETVARNAME(varDEVICE_s_Name02));
     
     varWIFI_s_Mode       = GetVarString(GETVARNAME(varWIFI_s_Mode)); //STA or AP or API_STA
     varWIFI_s_Password   = GetVarString(GETVARNAME(varWIFI_s_Password));
     varWIFI_s_SSID       = GetVarString(GETVARNAME(varWIFI_s_SSID));

