raibisch/ESP32_ABL/src/main.cpp
     varABL_i_U_netz      = GetVarInt(GETVARNAME(varABL_i_U_netz));
     varABL_i_A_soll_low  = GetVarInt(GETVARNAME(varABL_i_A_soll_low));
     varABL_i_A_soll_high = GetVarInt(GETVARNAME(varABL_i_A_soll_high),16);
     varABL_i_Scantime_ms = GetVarInt(GETVARNAME(varABL_i_Scantime_ms),30000);  

     varABL_i_Phase_count  = GetVarInt(GETVARNAME(varABL_i_Phase_count),3);
     varABL_i_I_limit     = GetVarInt(GETVARNAME(varABL_i_I_limit),16);
  #if WB_COUNT ==2
     varABL_i_LoadBal_mode= GetVarInt(GETVARNAME(varABL_i_LoadBal_mode),0);
  #endif
     varABL_i_Watt_16A    = GetVarInt(GETVARNAME(varABL_i_Watt_16A),(230*varABL_i_Phase_count*16));
     varABL_i_Watt_15A    = GetVarInt(GETVARNAME(varABL_i_Watt_15A),(230*varABL_i_Phase_count*15));
     varABL_i_Watt_14A    = GetVarInt(GETVARNAME(varABL_i_Watt_14A),(230*varABL_i_Phase_count*14));
     varABL_i_Watt_13A    = GetVarInt(GETVARNAME(varABL_i_Watt_13A),(230*varABL_i_Phase_count*13));
     varABL_i_Watt_12A    = GetVarInt(GETVARNAME(varABL_i_Watt_12A),(230*varABL_i_Phase_count*12));
     varABL_i_Watt_11A    = GetVarInt(GETVARNAME(varABL_i_Watt_11A),(230*varABL_i_Phase_count*11));
     varABL_i_Watt_10A    = GetVarInt(GETVARNAME(varABL_i_Watt_10A),(230*varABL_i_Phase_count*10));
     varABL_i_Watt_09A    = GetVarInt(GETVARNAME(varABL_i_Watt_09A),(230*varABL_i_Phase_count*9));
     varABL_i_Watt_08A    = GetVarInt(GETVARNAME(varABL_i_Watt_08A),(230*varABL_i_Phase_count*8));
     varABL_i_Watt_07A    = GetVarInt(GETVARNAME(varABL_i_Watt_07A),(230*varABL_i_Phase_count*7));
     varABL_i_Watt_06A    = GetVarInt(GETVARNAME(varABL_i_Watt_06A),(230*varABL_i_Phase_count*6));
#if WB_COUNT == 2
     varABL2_i_Phase_count = GetVarInt(GETVARNAME(varABL2_i_Phase_count),1);
     varABL2_i_Watt_16A   = GetVarInt(GETVARNAME(varABL2_i_Watt_16A),(230*varABL2_i_Phase_count*16));
     varABL2_i_Watt_15A   = GetVarInt(GETVARNAME(varABL2_i_Watt_15A),(230*varABL2_i_Phase_count*15));
     varABL2_i_Watt_14A   = GetVarInt(GETVARNAME(varABL2_i_Watt_14A),(230*varABL2_i_Phase_count*14));
     varABL2_i_Watt_13A   = GetVarInt(GETVARNAME(varABL2_i_Watt_13A),(230*varABL2_i_Phase_count*13));
     varABL2_i_Watt_12A   = GetVarInt(GETVARNAME(varABL2_i_Watt_12A),(230*varABL2_i_Phase_count*12));
     varABL2_i_Watt_11A   = GetVarInt(GETVARNAME(varABL2_i_Watt_11A),(230*varABL2_i_Phase_count*11));
     varABL2_i_Watt_10A   = GetVarInt(GETVARNAME(varABL2_i_Watt_10A),(230*varABL2_i_Phase_count*10));
     varABL2_i_Watt_09A   = GetVarInt(GETVARNAME(varABL2_i_Watt_09A),(230*varABL2_i_Phase_count*9));
     varABL2_i_Watt_08A   = GetVarInt(GETVARNAME(varABL2_i_Watt_08A),(230*varABL2_i_Phase_count*8));
     varABL2_i_Watt_07A   = GetVarInt(GETVARNAME(varABL2_i_Watt_07A),(230*varABL2_i_Phase_count*7));
     varABL2_i_Watt_06A   = GetVarInt(GETVARNAME(varABL2_i_Watt_06A),(230*varABL2_i_Phase_count*6));
#endif
#ifdef MQTT_ENABLE
     varMQTT_i_PORT       = GetVarInt(GETVARNAME(varMQTT_i_PORT),1883);
     varMQTT_s_HOST       = GetVarString(GETVARNAME(varMQTT_s_HOST)); 
     varMQTT_s_USER       = GetVarString(GETVARNAME(varMQTT_s_USER)); 
     varMQTT_s_PASS       = GetVarString(GETVARNAME(varMQTT_s_PASS));
     varMQTT_s_TOPIC_OUT  = GetVarString(GETVARNAME(varMQTT_s_TOPIC_OUT));
     varMQTT_s_PAYLOAD_OUT= GetVarString(GETVARNAME(varMQTT_s_PAYLOAD_OUT));
     varMQTT_s_TOPIC_IN   = GetVarString(GETVARNAME(varMQTT_s_TOPIC_IN));
#endif  
   }
};
ABL_FileVarStore varStore;

bool initFileVarStore()
{
  return varStore.Load();
}


static inline void forcePolling()
{
   for (size_t i = 0; i < WB_COUNT; i++)
   {
     ABL_forcePollFlag[i] = true;
   }
   
}

#ifdef MQTT_ENABLE
// Generate MQTT client instance
// N.B.: Default message buffer size is too small!
MQTTClient mqttclient(MQTT_PAYLOAD_SIZE);

void mqtt_messageReceived(String &topic, String &payload) 
{
  // Note: Do not use the client in the callback to publish, subscribe or
  // unsubscribe as it may cause deadlocks when other things arrive while
  // sending and receiving acknowledgments. Instead, change a global variable,
  // or push to a queue and handle it in the loop after calling `client.loop()`.
   debug_println("* MQTT: incoming: " + topic + " - " + payload);
   
   uint a = payload.substring(8,9).toInt();
   AsyncWebLog.println("MQTT SET-Imax:" + String(a)+ "A");
   if ((a >=6 && a <=16) || (a==0))
   {
      forcePolling();
      ABL_tx_Icmax = a;
      ABL_tx_status01 = SET_Current; // next Send Protocol
   }
   else
   {
      AsyncWebLog.println("**ERROR Imax out of range!");
   }
  ABL_tx_Icmax = payload.toInt();
}


/// @brief setup MQTT-client
void mqtt_setup()
{
  debug_println("* MQTT: connecting... ");
  mqttclient.begin(varStore.varMQTT_s_HOST.c_str(), varStore.varMQTT_i_PORT, client);
  mqttclient.onMessage(mqtt_messageReceived);
  while (!mqttclient.connect(MQTT_CLIENTID, varStore.varMQTT_s_USER.c_str(), varStore.varMQTT_s_PASS.c_str()))
  {
        Serial.print(".");
        delay(1000);
  }
  debug_println("* MQTT: connected!");

  debug_printf("* MQTT suscribe %s\r\n", varStore.varMQTT_s_TOPIC_IN.c_str());
  mqttclient.subscribe(varStore.varMQTT_s_TOPIC_IN);
}

/// @brief  MQTT run in loop()
inline void mqtt_loop()
{
    mqttclient.loop();
    delay(10);  // <- fixes some issues with WiFi stability

    if (!mqttclient.connected()) 
    {
      mqtt_setup();
    }
    char str[80] = {};
    // cheat: '%' in config.txt is replaces with '&' because web-edit does not allow % in string.  (varStore 'GetVarString' function does replace)
    // in config.txt:  varMQTT_s_PAYLOAD_OUT  ={"status":"&s", "ipm":&d, "w":&d, "wh":&d, "whsum":&d};
    // result -->                          str={"status":"%s", "ipm":%d, "w":%d, "wh":%d, "whsum":%d}
    // change if you want an other output !
    // ... or add more single publish messages for DOMOTICZ
    sprintf(str, varStore.varMQTT_s_PAYLOAD_OUT.c_str(), ABL_rx_status, ABL_rx_Ipwm, (int)(ABL_rx_kW*1000.0), (int)ABL_rx_Wh, (int)ABL_Wh_Sum_akt);
    debug_printf("* MQTT Topic_out:%s Payload:%s\r\n", varStore.varMQTT_s_TOPIC_OUT, str);
    mqttclient.publish(varStore.varMQTT_s_TOPIC_OUT, str);
   
