raibisch/ESP32_ABL/src/main.cpp
  }
  else
  {
   ABL_rx_kW[wb_ix] = 0;
   if (ABL_PauseFlag[wb_ix])
   {
        ABL_rx_Isum[wb_ix] = 0;
   } 
  } 

    
}

// 13.5.26 new: Load-Balance for 2 Wallboxes

/// @brief Set Imax with Load-Balance Limits and Modes
/// @param wb_ix 
/// @param icmax 
void setIcmax(uint_fast16_t wb_ix, uint16_t icmax)
{
  uint16_t imaxOther = 0;
  if (icmax > varStore.varABL_i_I_limit)
  {
    ABL_tx_Icmax[wb_ix] = varStore.varABL_i_I_limit;
  }
  else
  {
    ABL_tx_Icmax[wb_ix] = icmax;
  }

  //              PAUSE 
  // =========================================================
  if (icmax == 0) 
  {
    ABL_tx_Icmax[wb_ix] = 0;
  }
  else
  // varABL_i_LoadBal_mode==0   -->  Load Balance WB01 WB02 50%
  // =========================================================
  if (varStore.varABL_i_LoadBal_mode == 0)
  {
    for (size_t i = 0; i < WB_COUNT; i++)
    {
     //debug_printf("[LoadBal 0] calc1 WB0%d Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[i]);
     //AsyncWebLog.printf("[LoadBal:0] calc1 WB0%d Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[i]);
     if (i != wb_ix)
     {
       imaxOther += ABL_tx_Icmax[i];
       AsyncWebLog.printf("[LoadBal:0] calc2 WB%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);
             debug_printf("[LoadBal:0] calc2 WB%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);
     }
    }
    
    AsyncWebLog.printf("[LoadBal:0] set WB%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);
          debug_printf("[LoadBal:0] set WB%d ImaxOther:%d\r\n",wb_ix+1, imaxOther);

    if (icmax > (varStore.varABL_i_I_limit - imaxOther))
    {
      // Möglichkeit A: Rest ist nur noch verfügbar
      //ABL_tx_Icmax[wb_ix] = varStore.varABL_i_LoadBal_Imax - imaxFree;
      
      // Möglichkeit B: 50% Aufteilung --> z.Z. realisiert !
      for (size_t i = 0; i < WB_COUNT; i++)
      {
        ABL_tx_Icmax[i] = varStore.varABL_i_I_limit / 2;
        ABL_tx_status[i] = SET_Current;
      }
      
      debug_printf("[LoadBal 0] L I M I T ! WB%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]);
      AsyncWebLog.printf("[LoadBal:0] L I M I T ! WB%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]);
    }
    else
    {
      debug_printf("[LoadBal Mode:0] NO LIMIT WB%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]); 
      AsyncWebLog.printf("[LoadBal Mode:0] no limit WB0%d to Imax:%d\r\n",wb_ix+1, ABL_tx_Icmax[wb_ix]); 
    }
  }
   // varABL_i_LoadBal_mode == 1  -> WB01=ON WB02=PAUSE
   // =================================================
  else if ((varStore.varABL_i_LoadBal_mode == 1) && (wb_ix == 0))
  {
     ABL_tx_Icmax[1]  = 0;
     ABL_PauseFlag[1] = true;
     ABL_tx_status[1] = SET_Current;
           debug_printf("[LoadBal:1] Prio WB1\r\n");
     AsyncWebLog.printf("[LoadBal:1] Prio WB1\r\n");
   }

   else if ((varStore.varABL_i_LoadBal_mode == 2) && (wb_ix == 1))
   // varABL_i_LoadBal_mode == 1  -> WB01=ON WB02=PAUSE
   // =================================================
   if ((varStore.varABL_i_LoadBal_mode == 2) && (wb_ix == 1))
   {
     ABL_tx_Icmax[0]  = 0;
     ABL_PauseFlag[0] = true;
     ABL_tx_status[0] = SET_Current;
           debug_printf("[LoadBal:2] Prio WB2\r\n");
     AsyncWebLog.printf("[LoadBal:2] Prio WB2\r\n");
   }

 forcePolling();
 ABL_tx_status[wb_ix] = SET_Current;

}


/// @brief Read actual Icmax
/// @param wb_ix 
/// @return 
uint16_t getIcmax(uint_fast16_t wb_ix)
{
  if ((ABL_tx_Icmax[0] + ABL_tx_Icmax[1]) > varStore.varABL_i_I_limit)
  {
    return 8;
  }
  if (ABL_tx_Icmax[wb_ix] > varStore.varABL_i_I_limit)
  {
    return varStore.varABL_i_I_limit;
  }
  
  return ABL_tx_Icmax[wb_ix];
}

/// @brief 
/// @param wb_ix 
/// @param iwatt  in Watt NOT kW !!
void setPmax(uint_fast16_t wb_ix, uint16_t iwatt)
{
   uint nPhase = varStore.varABL_i_Phase_count;
   uint ILimit = varStore.varABL_i_I_limit;
   if (wb_ix == 1)
   {
     nPhase = varStore.varABL2_i_Phase_count;
   }
   uint16_t iAmpere = round(iwatt / (nPhase * varStore.varABL_i_U_netz));
   if (iAmpere > ILimit)
   {
     iAmpere= ILimit;
     AsyncWebLog.printf("[SetPmax] Warning: LIMIT-I:%d WB%d P:%dW I:%dA\r\n",ILimit, wb_ix+1, iwatt, iAmpere);   
   }
   else
   {
     AsyncWebLog.printf("[SetPmax]WB%d P:%dW I:%dA\r\n", wb_ix+1, iwatt, iAmpere);
   }
   setIcmax(wb_ix, iAmpere);
}


/// @brief Init ABL communication over RS485
void inline ABL_init()
{
    debug_printf("ABL_init: parameters: ABL_RXD_GPIO=%d, ABL_TXT_GPIO=%d, ABL_RX_LOW_ENABLE_GPIO=%d\r\n", ABL_RXD_GPIO, ABL_TXT_GPIO, ABL_RX_LOW_ENABLE_GPIO);
    debug_println("ABL_init: start to initialize...");
    Serial_ABL.begin(38400, SERIAL_8E1, ABL_RXD_GPIO, ABL_TXT_GPIO);
    ABL_rx_String="";
    //ABL_rx_String.reserve(200);
    pinMode(ABL_RX_LOW_ENABLE_GPIO, OUTPUT_OPEN_DRAIN);
    digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0);
    delay(1);
    //Serial_ABL.flush();
    debug_println("ABL_init: check serial connection...");
    while(Serial_ABL.available())
    {
        Serial_ABL.read();
    }
    forcePolling();
    ABL_PollTime_old  = 0;
    ABL_StatusSec_old = 0;
    debug_println("ABL_init: OK!");
}

/// @brief Send to ABL
/// @param s 
void ABL_Send(uint8_t wb_ix,  ABL_POLL_STATUS s)
{
 String tx = "";

 uint_fast16_t msg_ix_offset = wb_ix* ABL_TX_MSG_INDEX::TX_index_count;

 switch (s)
 {
  case POLL_Current:
    ABL_forcePollFlag[wb_ix] = 0;
    tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_POLL + msg_ix_offset]);
  break;

  case SET_Current:
    ABL_PauseFlag[wb_ix] = false;
    switch (ABL_tx_Icmax[wb_ix])
    {
      case 0:
        ABL_PauseFlag[wb_ix] = true;
        tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_DISABLE + msg_ix_offset]);
      break;
   
      case 6:
       tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_6A + msg_ix_offset]);
      break;

      case 7:
        tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_7A + msg_ix_offset]);
      break;

      case 8:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_8A + msg_ix_offset]);
      break;

      case 9:
           tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_9A + msg_ix_offset]);
      break;

      case 10:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_10A + msg_ix_offset]);
      break;
         
      case 11:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_11A + msg_ix_offset]);
      break;

