raibisch/ESP32_ABL/src/main.cpp
      case 12:
           tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_12A + msg_ix_offset]);
      break;

      case 13:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_13A + msg_ix_offset]);
      break;

      case 14:
          tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_14A + msg_ix_offset]);
      break;

      case 15:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_15A + msg_ix_offset]);
      break;

      case 16:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_16A + msg_ix_offset]);
      break;

      default:
         tx = String(ABL_TX_MSG[ABL_TX_MSG_INDEX::TX_SET_6A + msg_ix_offset]);
      break;
    }
  break; // End Set_Current

  //todo: additional Tx-Commands
  // 
  // ModifyState: Register 0x05
  // Enable:  A1A1
  // Disable: E0E0 
  
  // GetFirmware: Register 0x01
  
  default:
  break;
 } // end of swtich(s) --> ABL_POLL_STATUS

 AsyncWebLog.printf("TX%s\r\n", tx.c_str());
 debug_printf("TX %s\r\n",tx.c_str());
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1);
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // Switch from TX to RX
 delay(1000);
 // empty the first rx input because of possible trash after first ABL-wakeup call

 while (Serial_ABL.available() > 0) 
 {
    // cppcheck-suppress unreadVariable
    char inChar = (char)Serial_ABL.read();
 }
 
 // send 2x for wakeup from sleep
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1); // Switch form Rx to TX
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // switch from Tx to Rx
}

 /// @brief Parse the received Data from ABL
 /// @param s 
 bool ABL_ParseReceive(String s)
 {
/*
Register 0x002E Read current (full)
   r/w Reg leng, LRC
   r  46d   5
:01 03 002E 0005 C9   

Send: 
:0103002E0005C9
Answer: (Status A1 = not connected)
>01030A2EA1108503E803E803E8CD


                      0=not connected
                      0=not reduced
                      0=EN2 open
                      1=EN1 closes 
      Cnt Reg    State   0001       Imax       Ip1  Ip2  Ip3  LRC
      10                         133dx0.06
                                 = 8A
>01 03 0A 2E      A1     10        85          03E8 03E8 03E8 CD
cnt:               0      1         2          3 4  5 6  7 8 
>01 03 0A 2E      A1     10        64          03E8 03E8 03E8 EE
                                 100dx0.06
                                 =  6A
*/
  bool ret = false;
  uint_fast16_t wb_ix = 0;
  //String sLog = "";
  //sLog.reserve(250);
  AsyncWebLog.printf("RX%s", s.c_str());
  
  if (s.startsWith(">0",0))
  {
   if (s.startsWith("01",1))
   {
     wb_ix = 0;
   }
   if (s.startsWith("02",1))
   {
    wb_ix = 1;
   }
  }
  else
  {
    AsyncWebLog.printf("[RX  ]Parse **START-UNVALID!\r\n");
    ABL_rx_status[wb_ix] = ABL_STATUS_STRING[ABL_UNVALID];
    return false;
  }


  if(s.indexOf("03A02E") && s.length()>=28)
  {
     
       //sLog = "\r\nStatus:" + s.substring(9,11)+ " Ipwm:" + s.substring(13,15) + " I1:" + s.substring(15,19) +  + " I2:" + s.substring(19,23) + " I3:" + s.substring(23,27);
       //AsyncWebLog.println(sLog);  
       ABL_rx_status[wb_ix] = s.substring(9,11);
       try
       {
         ABL_rx_Ipwm[wb_ix] = (uint16_t)(round(HexString2int(s.substring(12,15)) * (float)0.06));
         uint32_t i1,i2,i3 =0;
        
         i1 = HexString2int(s.substring(15,19));
         if (i1 > 900)
         {i1=0;}

         i2 = HexString2int(s.substring(19,23));
         if (i2 > 900)
         {i2=0;}

         i3 = HexString2int(s.substring(23,27));
         if (i3 > 900)
         {i3=0;}
         
         ABL_rx_Isum[wb_ix] = (i1 +i2 + i3) / 10;
         
         //sLog = "WB" + String(wb_ix+1) + " state:" + ABL_rx_status[wb_ix] + " Ipwm:"+ String(ABL_rx_Ipwm[wb_ix])+  " I:"+ String(i1/10.0)+ "+" + String(i2/10.0) +"+" +String(i3/10.0) +"=Isum:"+ String(ABL_rx_Isum[wb_ix]);
         AsyncWebLog.printf("[RX  ]WB%d Parser Status:%s, Ipwm:%d, Isum:%3.2f\r\n",wb_ix+1,ABL_rx_status[wb_ix].c_str(), ABL_rx_Ipwm[wb_ix], ABL_rx_Isum[wb_ix]);
         ret = true;
    
       }
       catch(const std::exception& e)
       {
         ABL_rx_Isum[wb_ix] = 0;
         AsyncWebLog.printf("[RX  ]WB%d Parser**Exeption!\r\n", wb_ix+1);
       }   
  }
  else
  if (s.indexOf("1000140001"))
  //if (s.startsWith(">011000140001DA")) // 14 = set Imax OK (duty cycle)
  {
    // >011000140001DA
    AsyncWebLog.printf("[RX  ]WB%d Parser Set-Imax OK\r\n", wb_ix+1);
    ABL_tx_status[wb_ix] = POLL_Current;  // next Command
    forcePolling();
  }
  //else
  //if (s.startsWith(">01"))
  //{
  //   AsyncWebLog.println("*RX-UNKNOWN!:" + s);
  //}
  else
  {
    AsyncWebLog.printf("[RX  ]WB%d Parser **UNVALID!\r\n", wb_ix+1);
    ABL_rx_status[wb_ix] = ABL_STATUS_STRING[ABL_UNVALID];
    ret = false;
  }

  ABL_rx_String = "";
  return ret;
 }



void serialEventABL() 
{
    static char inChar;
    while (Serial_ABL.available() > 0) 
    {
     delay(20);
     inChar = (char)Serial_ABL.read();
     ABL_rx_String += inChar;
     debug_print(inChar);
     if (inChar == '\n') 
     {
      //debug_printf("RX:%s\r\n",ABL_rx_String.c_str());
      //AsyncWebLog.println("RX"+ ABL_rx_String);
      if (ABL_ParseReceive(ABL_rx_String))
      {
       
        if (ABL_rx_String.startsWith("01",1))
         {ABL_rx_timeoutcount[0] = 0;}
        else if (ABL_rx_String.startsWith("02",1))
         {ABL_rx_timeoutcount[1] = 0;}
      }
      ABL_rx_String = "";
      //delay(100);
      //setLED(0); // LED off
    }
   } // while
}

#ifdef USE_ETH_INSTEAD_WIFI
//////////////////////////////////////////
/// @brief Init Ethernet
/////////////////////////////////////////
void initEthernet()
{
    debug_print("Starting ETH interface...");
    ETH.begin();
    delay(200);
    ETH.setHostname(varStore.varDEVICE_s_Name.c_str());

    debug_print("ETH MAC: ");
    debug_print(ETH.macAddress());
    debug_print("IP Address: ");
    debug_print(ETH.localIP());
    SYS_IP = ETH.localIP().toString();
    return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void handleEthernetConnection() 
{
}
#endif // USE_ETH_INSTEAD_WIFI

//////////////////////////////////////////
/// @brief Init Wifi
/////////////////////////////////////////

