raibisch/ESP32_ABL/src/main.cpp
void initWifi(bool bSetAP)
{
  // Test mit AP !!!!!!!!!!!!!!!!!!!!!
  //varStore.varWIFI_s_Mode="AP";
  // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  // API Info: https://docs.espressif.com/projects/esp-idf/en/v4.4.6/esp32/api-reference/network/esp_wifi.html 
   if (bSetAP || (varStore.varWIFI_s_Mode == "AP"))
   {
    debug_println("WIFI:AP-Mode");
    varStore.varWIFI_s_Mode = "AP";

    WiFi.softAP("ESP_ABL_AP",varStore.varWIFI_s_Password.c_str());   
    debug_print("IP Address: ");
    SYS_IP = WiFi.softAPIP().toString();
    debug_println(SYS_IP);
   }
   else
   {
    debug_println("WIFI:STA-Mode\r\n");
    WiFi.mode(WIFI_STA);
  
    if (varStore.varWIFI_s_SSID.length() < 2)
    {
      varStore.varWIFI_s_SSID = "noSSID";
    }
    WiFi.setHostname(varStore.varDEVICE_s_Name.c_str());
  
    wl_status_t wifiStatus;
    wifiStatus = WiFi.begin(varStore.varWIFI_s_SSID.c_str(), varStore.varWIFI_s_Password.c_str());
    delay(500);
    int i = 0;
    Serial.printf("SSID:%s\r\n", varStore.varWIFI_s_SSID.c_str());
    ///debug_printf("Passwort:%s\r\n", varStore.varWIFI_s_Password);
    while ((WiFi.waitForConnectResult() != WL_CONNECTED) && (i < 20))
    {
        Serial.print(".");
        setLED(i%2);
        i++;  
        delay(300);
    }
    if (WiFi.waitForConnectResult() == WL_CONNECTED)
    {
      Serial.printf("Get WiFi-Power:%d\r\n",WiFi.getTxPower());
      Serial.printf("Get WiFi-RSSI:%d\r\n",WiFi.RSSI());
      
      Serial.printf("IP Address: ");
      SYS_IP = WiFi.localIP().toString();
      Serial.println(SYS_IP);
      return;
    }
    else
    {
      WiFi.disconnect(false, true);
      Serial.printf("\r\n******** no valid login to:'%s' *******************************\r\n", varStore.varWIFI_s_SSID.c_str());
      Serial.printf(    "******** connect to local AP:'ESP_ABL_AP' IP: 192.168.4.1 *****\r\n");
      varStore.varWIFI_s_Mode = "AP";
      WiFi.mode(WIFI_AP);
      WiFi.softAP("ESP_ABL_AP", NULL, 6, 0, 4,false);
      debug_print("IP Address: ");
      SYS_IP = WiFi.softAPIP().toString();
      debug_println(SYS_IP);
      return;
    }
   }

  return;
}

//////////////////////////////////////////
/// @brief Manage the Wifi Connection
/////////////////////////////////////////
void testWifiConnection() 
{
    if (varStore.varWIFI_s_Mode == "STA")
    {
      debug_printf("[WiFi] Mode:STA IP:%s RSSI:%d\r\n", WiFi.localIP().toString().c_str(), WiFi.RSSI());
      if  (WiFi.status() != WL_CONNECTED)
      {
        // Force reconnect without freezing the main loop execution
        SYS_RestartCount++;
        hist.putInt("restart",SYS_RestartCount);
        WiFi.disconnect();
        WiFi.begin(varStore.varWIFI_s_SSID, varStore.varWIFI_s_Password);
      }

      // V2.1 new: optional extra test with ping to GatewayIP   
#ifdef PINGTEST
      if (Ping.ping(WiFi.gatewayIP(),1) > 0)
      {
       debug_printf("[PING ] response time : %d/%.2f/%d ms\r\n", Ping.minTime(), Ping.averageTime(), Ping.maxTime());
       AsyncWebLog.printf("[PING ] response: %d ms\r\n", Ping.minTime());
      } 
      else 
      {
       debug_println(" Ping Error !");
       SYS_RestartCount++;
       hist.putInt("restart",SYS_RestartCount);
       WiFi.disconnect();
       WiFi.begin(varStore.varWIFI_s_SSID, varStore.varWIFI_s_Password);
      }
#endif
    }   
    else
    {
      // remove debug log of Passwort if you dont want to show it in log !
      debug_printf("[WiFi] Mode:AP IP:%s Password:%s\r\n", WiFi.softAPIP().toString().c_str(), varStore.varWIFI_s_Password.c_str());
    }
    // Test if wifi is lost from router
 
}

static String readString(File s) 
{
  String ret;
  int c = s.read();
  while (c >= 0) {
    ret += (char)c;
    c = s.read();
  }
  return ret;
}

int getIntStatus(uint_fast16_t wb_ix)
{
   long intValue = strtol(ABL_rx_status[wb_ix].c_str(), NULL, 16);
   return intValue;
}


// -------------------- WEBSERVER ----------------------------------------------
// -----------------------------------------------------------------------------
//


/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String setHtmlVar(const String& var)
{
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!SPIFFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = SPIFFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }
    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID02")
  {
    return varStore.varDEVICE_s_Name02;
  }
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  else
  if (var== "I-HIGH")
  {
    return "I-HIGH(" + String(varStore.varABL_i_A_soll_high) + "A)";
  }
  else
  if (var== "I-LOW")
  {
    return "I-LOW(" + String(varStore.varABL_i_A_soll_low) + "A)";
  }
  else
  if (var == "KWHSUM")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt[0] > 0)
    {
      f = ABL_Wh_Sum_akt[0] / 1000.00;
    }
    return String(f);
  } 
   if (var == "KWHSUM02")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt[1] > 0)
    {
      f = ABL_Wh_Sum_akt[1] / 1000.00;
    }
    return String(f);
  } 
  else
  if (var == "INFO")
  {
#ifndef WITHOUT_TEMP
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor.dac_offset = TSENS_DAC_L2;  // TSENS_DAC_L2 is default; L4(-40°C ~ 20°C), L2(-10°C ~ 80°C), L1(20°C ~ 100°C), L0(50°C ~ 125°C)
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    float temp_celsius = 0;
    temp_sensor_read_celsius(&temp_celsius);
    String temp = String(temp_celsius);
#else
    String temp = "(unknown)";
#endif // WITHOUT_TEMP
  
     return   "Version     :"   + SYS_Version + 
            "\nBuild       :" + SYS_CompileDate + " "+ SYS_CompileTime + 
            "\nPlatform    :" + ESP.getChipModel() +
            "\nTemp(C)     :" + temp +
            "\nIP-Addr     :" + SYS_IP +
            "\nRestart-Cnt :" + SYS_RestartCount + 
            "\nRSSI        :" + String(WiFi.RSSI()) + 
  #if WB_COUNT == 2          
            "\nLoadBal-Mode:" + String(varStore.varABL_i_LoadBal_mode) +
            "\nLoadBal-Isum:" + String(varStore.varABL_i_I_limit) +
            "\nPhase-Count :" + String(varStore.varABL_i_Phase_count) + 
            "\nPhase-Count2:" + String(varStore.varABL2_i_Phase_count) + 
        
