raibisch/ESP32_ABL/src/main.cpp
            "\nTimeoutCnt01:" + ABL_rx_timeoutcount[0] +
            "\nTimeoutCnt02:" + ABL_rx_timeoutcount[1] + 
            "\nChargeCnt01 :" + SYS_ChargeCount[0] + 
            "\nChargeCnt02 :" + SYS_ChargeCount[1] + 
  
            "\nIpwm01      :" + String(ABL_rx_Ipwm[0]) + 
            "\nIpwm02      :" + String(ABL_rx_Ipwm[1]) + 
            "\nStatus1     :" + ABL_rx_status[0] +
            "\nStatus2     :" + ABL_rx_status[1];
  #else 
                    
            "\nPhase-Count :" + String(varStore.varABL_i_Phase_count) + 
            "\nTimeoutCnt  :" + ABL_rx_timeoutcount[0] +
            "\nChargeCnt   :" + SYS_ChargeCount[0] + 
            "\nIpwm        :" + String(ABL_rx_Ipwm[0]) + 
            "\nStatus      :" + ABL_rx_status[0];
  #endif

  }
  else
  if (var == "IMAX")
  {
     
     if (ABL_PauseFlag[0] == false)
     {
       ABL_tx_Icmax[0] = ABL_rx_Ipwm[0];
     }
     return String(ABL_tx_Icmax[0]);
  }
  else
  if (var == "IMAX2")
  {
     if (ABL_PauseFlag[1] == false)
     {
       ABL_tx_Icmax[1] = ABL_rx_Ipwm[1];
     }
     return String(ABL_tx_Icmax[1]);
    
  }
  else 
  if (var == "ILIMIT")
  {
    return String(varStore.varABL_i_I_limit);
  }
  else 
  if (var == "UGRID")
  {
    return String(varStore.varABL_i_U_netz);
  }
  else 
  if (var == "NPHASE")
  {
    return String(varStore.varABL_i_Phase_count);
  }
  if (var == "NPHASE2")
  {
    return String(varStore.varABL2_i_Phase_count);
  }
   else 
  if (var == "PMAX")
  {
     if (ABL_PauseFlag[0] == false)
     {
       ABL_tx_Icmax[0] = ABL_rx_Ipwm[0];
     }
    return String(round((varStore.varABL_i_Phase_count * varStore.varABL_i_U_netz * ABL_tx_Icmax[0])/1000));
  }
  if (var == "PMAX2")
  {
     if (ABL_PauseFlag[1] == false)
     {
       ABL_tx_Icmax[1] = ABL_rx_Ipwm[1];
     }
    return String(round((varStore.varABL2_i_Phase_count * varStore.varABL_i_U_netz * ABL_tx_Icmax[1])/1000));
  }
    
  return String();
}

void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// for "/" and "/index" handle post
void Handle_Index_Post(AsyncWebServerRequest *request)
{
   debug_println("Argument: " + request->argName(0));
   debug_println("Value: ");
   uint8_t wb_ix_local = 0;
   //String s  = request->arg(i);
   //debug_println(s);
   //String sRet = "";
   if (request->argName(0) == "ihigh")
   {
     //ABL_Send("high");
     //ABL_tx_Icmax[0] = varStore.varABL_i_A_soll_high;
     setIcmax(0, varStore.varABL_i_A_soll_high);
     AsyncWebLog.println("SET-Current WB1:" + String(ABL_tx_Icmax[0]) + "A");
   }
   else
   if (request->argName(0) == "ilow")
   {
       //sRet = ABL_Send("low");
       //ABL_tx_Icmax[0] = varStore.varABL_i_A_soll_low;
       setIcmax(0, varStore.varABL_i_A_soll_low);
       AsyncWebLog.println("SET-Current WB1:" + String(ABL_tx_Icmax[0]) + "A");
   }
   else
   if (request->argName(0) == "pause")
   {
       //sRet = ABL_Send("low");
       //ABL_tx_Icmax[0] = 0;
       setIcmax(0, 0);    
       AsyncWebLog.println("CHARGE-PAUSE WB1");
    }

  // 2. Wallbox
   if (request->argName(0) == "ihigh2")
   {
     //ABL_Send("high");
     wb_ix_local = 1;
     //ABL_tx_Icmax[1] = varStore.varABL_i_A_soll_high;
     setIcmax(1, varStore.varABL_i_A_soll_high);
     AsyncWebLog.println("SET-Current WB2:" + String(ABL_tx_Icmax[1]) + "A");
   }
   else
   if (request->argName(0) == "ilow2")
   {
       //sRet = ABL_Send("low");
       wb_ix_local = 1;
       //ABL_tx_Icmax[1] = (int)varStore.varABL_i_A_soll_low;
       setIcmax(1, varStore.varABL_i_A_soll_low);
       AsyncWebLog.println("SET-Current WB2:" + String(ABL_tx_Icmax[1]) + "A");
   }
   else
   if (request->argName(0) == "pause2")
   {
       //sRet = ABL_Send("low");
       wb_ix_local = 1;
       setIcmax(1, 0);
       AsyncWebLog.println("CHARGE-PAUSE WB2");
    }
   
   if (wb_ix_local == 0)
   { 
#if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
   }
   else
   {
    request->send(SPIFFS, "/index2.html", String(), false, setHtmlVar);
   }
}

void initWebServer()
{ 
  debug_print("Init web server...\n");
    //Route for root / web page
  server.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    if (bInitFileOK) 
    { 
#if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
    }
    else
    { // "rescue page" for first run without valid Wifi-credentials or no valid data-system
      request->redirect("/ota_ap.html");
      //request->send(202, "text/plain", "goto: http://192.168.4.1/ota_ap.html");
    }
  });

   
  // Notfall Website 'ota_ap.html' für Software-Upload
  static const char* staticOTA_site PROGMEM = R"(
<!DOCTYPE HTML><html lang="de"><head>
<title>OTA-Update</title><meta charset="UTF-8"></head>
<body><form method='POST' action='/ota_update' enctype='multipart/form-data'></p><div>Select a file 'myFS.bin' (myFS-Data) or 'firmware.bin' (Program)</div><input class='container' type='file' name='update' accept='.bin'><input type='submit' name="startupdate" value='START-UPLOAD'><BR></form>
</p><a class="buttonlink" href="reboot.html">REBOOT!</a>
</body></html>
)";
  server.on("/ota_ap.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(200, "text/html", staticOTA_site);
  });


  //Route for root /index web page
  server.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   #if WB_COUNT == 2
     request->send(SPIFFS, "/index1.html", String(), false, setHtmlVar);
#else
    request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
#endif
  });

  
  //Route for root /index web page
  server.on("/index2.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index2.html", String(), false, setHtmlVar);
  });


  // > Version V1.2
  //Route for stored values
  server.on("/setpower.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setpower.html", String(), false, setHtmlVar);
  });

