raibisch/ESP32_ABL/src/main.cpp
  server.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/file-list.png", String(), false);
  });
  server.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/settings.png", String(), false);
  });
  server.on("/current.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/current.png", String(), false);
  });
   server.on("/wb.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/wb.png", String(), false);
  });



  // ...a lot of code only for icons and favicons ;-))
  server.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/manifest.json", String(), false);
  });
  server.on("/favicon.ico",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/favicon.ico", String(), false);
  });
  server.on("/apple-touch-icon.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/apple-touch-icon.png", String(), false);
  });
  server.on("/android-chrome-192x192.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-192x192.png", String(), false);
  });
  server.on("/android-chrome-384x384.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-384x384.png", String(), false);
  });

  // ------------ POSTs --------------------------------------------------------------------------
  // root (/) POST
  server.on("/",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });

  // index.html POST
  server.on("/index.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });

  // index1.html POST
  server.on("/index1.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  }); 

  server.on("/index2.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  
  // > Version V1.2 set current in extra page
  // index.html POST
  server.on("/setpower.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  
   // > Version V1.2 set current in extra page
  // index.html POST
  server.on("/setpower2.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });


  
  // config.html POST
  server.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   //debug_println("Argument: " + request->argName(0));
   //debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "saveconfig")
   {
       varStore.Save(s);
       varStore.Load();
   }
   //debug_println("Request /index3.html");
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });
  
  
  // setvalues.html POST
  server.on("/setvalues.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   debug_println("Argument: " + request->argName(0));
   debug_print("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "kwh") // 01 kW/h Sum
   {
      ABL_Wh_Sum_akt[0] = u_long(s.toFloat()*1000);
      debug_print("ABL_Wh_Sum_akt: ");
      debug_println(ABL_Wh_Sum_akt[0]);
      set_Wh_Sum(0,ABL_Wh_Sum_akt[0]);
      ABL_Wh_Sum_old[0] = ABL_Wh_Sum_akt[0];
      saveHistory();
   } 
   else
   if (request->argName(0) == "kwh02") // 02 kW/h Sum
   {
      ABL_Wh_Sum_akt[1] = u_long(s.toFloat()*1000);
      debug_print("ABL_Wh_Sum_akt: ");
      debug_println(ABL_Wh_Sum_akt[1]);
      set_Wh_Sum(1,ABL_Wh_Sum_akt[1]);
      ABL_Wh_Sum_old[1] = ABL_Wh_Sum_akt[1];
      saveHistory();
   } 
      
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });

  
  server.onNotFound(notFound);

  AsyncWebLog.begin(&server);
  AsyncWebOTA.begin(&server);
  server.begin();
}


void initSPIFFS()
{
  if (!SPIFFS.begin())
  {
   debug_println("*** ERROR: SPIFFS Mount failed");
  } 
  else
  {
   debug_println("* INFO: SPIFFS Mount succesfull");
  }
}


// ------------------((ABL_rx_status.startsWith("C")) && --------------------------
void setup()
{
  delay(1000);
  Serial.begin(115200);
  delay(800);
  Serial.println("*** ABL: Setup-Start ***");
  initSPIFFS();
#ifndef WITHOUT_LED
  initLED();
#endif
  bInitFileOK = initFileVarStore();
  initHistory();
#ifdef USE_ETH_INSTEAD_WIFI
  initEthernet();
#else
  initWifi(!bInitFileOK);
#endif
  delay(200);
#ifdef MQTT_ENABLE
  mqtt_setup();
#endif  
  initWebServer();
  ABL_init();
 
  rtc[0].setTime(0);
  rtc[1].setTime(0);
  Serial.println("*** ABL Setup End ***");
}


void set_tmp_poll_time_ms()
{
  if (ABL_forcePollFlag[0])
    {
      tmp_poll_time_ms = 2500;
      return;
    }
#if WB_COUNT == 2
    else
    if (ABL_forcePollFlag[1])
    {
      tmp_poll_time_ms = 2500;
      return;
    }
#endif
   
#if WB_COUNT == 2
    if ((ABL_rx_status[0].indexOf('A') >= 0) && (ABL_rx_status[1].indexOf('A') >= 0))
#else 
    if ((ABL_rx_status[0].indexOf('A') >= 0))
#endif
    { 
      tmp_poll_time_ms = varStore.varABL_i_Scantime_ms;} // value > 30sec reduces standby power 
    else
    {
       tmp_poll_time_ms = 5000;
    }
     
}


static uint_fast16_t last_wb_poll_ix = 0;
static int main_iBlink;
void loop()
{
    set_tmp_poll_time_ms();

    if (millis() > (ABL_PollTime_old + tmp_poll_time_ms))
    {
      AsyncWebLog.printf("[Poll] Time:%dms\r\n", tmp_poll_time_ms);
  #if WB_COUNT == 2
      if (last_wb_poll_ix >= WB_COUNT-1)
      {last_wb_poll_ix = 0;}
      else
      {last_wb_poll_ix++;}
  #else
      last_wb_poll_ix = 0;
  #endif

      // jetzt in ABL_Send !
      //ABL_forcePollFlag[last_wb_poll_ix] = false;
      ABL_PollTime_old  = millis();
      log_timer = tmp_poll_time_ms / 1000;
      ABL_Send(last_wb_poll_ix,ABL_tx_status[last_wb_poll_ix]);
      testTimeount(last_wb_poll_ix); 
    

      // Test Network connection
#ifdef USE_ETH_INSTEAD_WIFI
      testEthernetConnection();
#else
      testWifiConnection();
#endif
    }
    else
    if (millis() - varStore.varABL_i_logtime_ms > ABL_StatusSec_old)
    { 
      //calculate_kWh(last_wb_poll_ix);
      setLED(main_iBlink%2);
      main_iBlink++;
      ABL_StatusSec_old = millis();

      for (size_t i = 0; i < WB_COUNT; i++)
      {
        calculate_kWh(i);
      }

      if (log_timer > 0)
      {log_timer--;}
      else
      {log_timer = tmp_poll_time_ms / 1000;}
#if WB_COUNT == 2         
      uint8_t ii= 0;
      if (last_wb_poll_ix == 0)
      {ii=1;}
      AsyncWebLog.printf("[Poll]WB%d next Tx sec:%d\r\n",ii+1, log_timer);
            debug_printf("[Poll]WB%d next Tx sec:%d\r\n",ii, log_timer);
#else
       AsyncWebLog.printf("[Poll] next Tx sec:%d\r\n",log_timer);
             debug_printf("[Poll] next Tx sec:%d\r\n",log_timer);
#endif
    }
    else
    {
       serialEventABL();
    }
#ifdef MQTT_ENABLE
    mqtt_loop();
#endif  
   delay(1);
  
}
